<?php 
include 'core/init.php';
include 'includes/overall/header.php';
?>
<div role="main" class="main">
	<section class="page-top">
		<div class="container">
		
			<div class="row">
				<div class="col-md-12">
					<h2>Σχετικά με εμάς</h2>
				</div>
			</div>
		</div>
	</section>
	<div class="container">
		<p>
		To site αυτο δημιουργήθηκε απο τον <strong>Αντώνη Λιλή</strong> για τις ανάγκες της εργασίας στα πολυμέσα.<br>
		Περιέχει κώδικα σε <strong>HTML5, CSS3, Javascript, Ajax, Jquery</strong>. Χρησιμοποιήθηκε το θέμα Porto που αγοράστηκε απο το themeforest.<br>
		To θέμα χρησιμοποιεί bootstrap CSS.<br> 
		<strong>Δημιούργησα μια βάση δεδομένων με τους πίνακες:</strong><br>
		<strong>Users:</strong>  Ο πίνακας που περιέχει τις πληροφορίες του χρήστη<br>
		<strong>Clients:</strong> Περιέχει ολες τις πληροφορίες για τα μαγαζιά<br>
		<strong>Favourites:</strong> Περιεχει όλα τα μαγαζιά που έχει προσθέσει ο χρήστης στα αγαπημένα του<br>
		<strong>Categories:</strong> Περιέχει όλες τις κατηγορίες των μαγαζιών (πχ NightClub, Καφετέρια κτλ)<br>
		<strong>Liked:</strong> Περιέχει όλα τα like που κάνουν οι χρήστες στα μαγαζιά<br>
		<strong>Locations:</strong> Περιέχει τις περιοχές και τα προάστιά τους.<br>
		<br>
		Δημιούργησα και τα αρχεία <strong>view.php, edit.php, new.php, delete.php</strong> μέσω των οποίων μπορούμε να διαχειριστούμε τον πίνακα Clients<br>
		ωστε να εισάγουμε, να δούμε, να επεξεργαστούμε και να διαγράψουμε εγγραφές μέσω της ιστοσελίδας μας σε όμορφο περιβάλλον.<br>
		<br>
		Τα μαγαζιά που έχω περάσει είναι συμβολικά σε αριθμό για τις ανάγκες της εργασίας.<br>
		<br>
		Έχω χρησιμοποιήσει ασφάλεια των δεδομένων μας για τυχών XSS Attack ή SQL Injection. <br>
		<br>
		Δέν χρησιμοποίησα σε όλα τα queries PDO μέθοδο αλλά mysql_query. O λόγος ήταν για να δείξω και τις δυο μεθόδους και τους τρόπους<br>
		ασφαλείας τους. Ενώ το PDO είναι πολύ δυνατότερο σε ασφάλεια έκανα χειροκίνητα κάποιες μεθόδους ασφάλειας μέσω του mysql_query.<br>
		<br>
		Δημιούργησα 3 αρχεία με τις function που χρησιμοποιήθηκαν. <br>
		Το <strong>users.php:</strong> Οι functions για τους users μας<br>
		Tο <strong>magazia.php:</strong> Οι functions για όλο το υπόλοιπο site<br>
		και το <strong>general.php:</strong> Κάποιες γενικές functions όπως για ασφάλεια.<br>
		<br>
		Οι χρήστες κάνουν login ή register. Mέσω της <strong>function protect_page()</strong> προστατεύουμε τις σελίδες που για να έχεις προσβαση πρέπει να συνδεθείς.<br>
		Αφού φτιάξεις λογαριασμό πρέπει να επιβεβαιώσεις το email σου για να ενεργοποιήθει. Στην εργασία λόγω οτι δούλεψα localhost ενεργοποιούμε χειροκίνητα 
		τον λογαριασμό.<br>
		<strong>Αφου ο χρήστης συνδεθεί αλλάζει ο header που πλέον περιέχει το μενου του χρήστη οπου μπορεί να δει τα αγαπημένα του, να αλλάξει τις ρυθμίσεις του <br>
		(αλλαγή κωδικού και email), να κάνει αποσύνδεση και να δεί τις σελίδες που είναι προστατευμένες απο τους guests.<br>
		Oi Χρήστες μπορούν να δούν τα μαγαζιά, να κάνουν like, να τα προσθέσουν στα αγαπημένα τους, να φιλτράρει τα μαγαζία βάση της κατηγορίας τους,<br>
		να αναζητήσει μαγαζιά βάση ονόματος, ετικέτας, τηλεφώνου, περιοχής, email.<br> 
		Μπορεί επίσης να επικοινωνήσει μαζί μας μέσω του contact page.<br> 
		</strong><br>
		<br>
		Το site δουλεύει άψογα για τις ανάγκες της εργασίας απλώς δεν έχει μεγάλο περιεχόμενο απο μαγαζιά. Τα πολυμέσα που χρησιμοποιεί είναι φυσικά εικόνες αλλά και βίντεο.<br> 
		</p>
	</div>
</div>
<?php
include 'includes/overall/footer.php';
 ?>